print("Введите день")
A = int(input())

print("Введите месяц")
B = int(input())

days=['','первое','второе','третье','четвертое','пятое','шестое','седьмое','восьмое','девятое',"десятое",'одиннадцатое','двенадцатое','тринадцатое','четырнадцатое','пятнадцатое','шестнадцатое','семнадцатое','восемнадцатое','девятнадцатое','двадцатое','двадцать первое','двадцать второе','двадцать третье','двадцать четвертое','двадцать пятое','двадцать шестое','двадцать седьмое','двадцать восьмое','двадцать девятое','тридцатое','тридцать первое']
months=["",'января','февраля','марта','апреля','мая','июня','июля','августа','сентября','октября','ноября','декабря']

print(days[A], months[B])
